app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comments_params)
    if @comment.save
---
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "sixth comment"], ["post_id", 1], ["created_at", "2016-11-07 22:13:16.402594"], ["updated_at", "2016-11-07 22:13:16.402594"]]