app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post 1"], ["content", "Here's the content"], ["created_at", "2016-11-07 17:52:15.634415"], ["updated_at", "2016-11-07 17:52:15.634415"]]